---
kind: method
id: M:Autodesk.Revit.DB.Frame.IsOrthogonal
source: html/50351f59-56cc-0e6a-9db6-02b6b5cb0f21.htm
---
# Autodesk.Revit.DB.Frame.IsOrthogonal Method

Determines if this frame's basis vectors are orthogonal.

## Syntax (C#)
```csharp
public bool IsOrthogonal()
```

## Returns
True if this frame's basis vectors are orthogonal, false if not.